a52dec
abseil-cpp
accountsservice
acl
acme-tiny
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
ansible
ansible-core
aom
archlinux-keyring
argon2
aspell
at-spi2-core
atkmm
attr
audit
autoconf
automake
avahi
b43-fwcutter
base
base-devel
bash
bash-completion
bind
binutils
bison
bluez
bluez-libs
bluez-utils
boost-libs
box2d
bridge-utils
brotli
btrfs-progs
bubblewrap
bzip2
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cairomm-1.16
cantarell-fonts
catdoc
cdparanoia
chromaprint
cifs-utils
cinnamon-desktop
cinnamon-translations
clucene
confuse
containerd
copyq
coreutils
cpio
cryptsetup
cups
cups-browsed
cups-filters
cups-pdf
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dconf
debugedit
default-cursors
desktop-file-utils
device-mapper
dex
diffutils
ding-libs
discord
dmenu
dmidecode
dmraid
dnsmasq
dnssec-anchors
docker
docker-buildx
docker-scan
dosfstools
double-conversion
downgrade
dracut
duf
duktape
dunst
dwayland
e2fsprogs
efibootmgr
efitools
efivar
ell
enchant
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-theming
eos-apps-info
eos-bash-shared
eos-hooks
eos-log-tool
eos-packagelist
eos-qogir-icons
eos-quickstart
eos-rankmirrors
eos-translations
ethtool
exempi
exfatprogs
expac
expat
f2fs-tools
faac
faad2
fakeroot
feh
ffmpeg
ffmpegthumbnailer
fftw
file
filesystem
findutils
firefox
firewalld
fish
flac
flex
fluidsynth
fontconfig
foomatic-db-engine
freetype2
fribidi
fsarchiver
fuse-common
fuse2
fuse3
fzf
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gd
gdbm
gdk-pixbuf2
geoclue
gettext
ghostscript
giflib
git
glances
glew
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
gmp
gnupg
gnutls
gobject-introspection-runtime
gperftools
gpgme
gpm
graphene
graphite
grep
groff
gsettings-desktop-schemas
gsm
gspell
gssdp
gssproxy
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-ugly
gstreamer
gtest
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm-4.0
gtkmm3
gtksourceview3
gtksourceview4
guile
gupnp
gupnp-igd
gvfs
gvfs-afc
gvfs-dnssd
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-onedrive
gvfs-smb
gvfs-wsdd
gzip
harfbuzz
harfbuzz-icu
haveged
hdparm
hicolor-icon-theme
hidapi
highway
hplip
hunspell
hwdata
hwdetect
hwinfo
hyphen
i3-wm
i3blocks
i3lock
i3status
iana-etc
icu
ijs
imagemagick
imath
imlib2
inetutils
inxi
iproute2
iptables-nft
iputils
iso-codes
iwd
jansson
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk21-openjdk
jemalloc
jfsutils
jpegexiforient
json-c
json-glib
kbd
kconfig5
kcoreaddons5
kernel-install-for-dracut
keyutils
ki18n5
kitty
kitty-shell-integration
kitty-terminfo
kmod
knotifications5
krb5
kwindowsystem5
l-smash
lame
lcms2
ldb
less
libabw
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcups
libcupsfilters
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdecor
libdeflate
libdovi
libdrm
libdv
libdvdcss
libdvdnav
libdvdread
libe-book
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libgcrypt
libgdata
libgirepository
libglvnd
libgme
libgnomekbd
libgoa
libgpg-error
libgphoto2
libgsf
libgudev
libheif
libice
libidn
libidn2
libiec61883
libieee1284
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libisl
libixion
libjpeg-turbo
libjxl
libksba
liblangtag
liblc3
libldac
libldap
liblqr
liblrdf
libltc
libluv
libmanette
libmaxminddb
libmbim
libmd
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpeg2
libmspub
libmtp
libmwaw
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnghttp3
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libomxil-bellagio
libopenmpt
libopenraw
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplacebo
libplist
libpng
libppd
libproxy
libpsl
libpulse
libqmi
libqrtr-glib
libqxp
libraqm
libraw1394
libreoffice-fresh
librest
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunibreak
libunistring
libunwind
liburcu
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libverto
libvisio
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwnck3
libwpd
libwpe
libwps
libx11
libx86emu
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lightdm
lightdm-gtk-greeter
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
llvm-libs
lm_sensors
lmdb
logrotate
lpsolve
lsb-release
lsscsi
lua
lua51-lpeg
luajit
luit
lv2
lvm2
lxc
lz4
lzo
m4
mailcap
maim
make
man-db
man-pages
mate-polkit
maven
md4c
mdadm
meld
mesa
mesa-utils
mjpegtools
mlocate
mobile-broadband-provider-info
modemmanager
mpdecimal
mpfr
mpg123
msgpack-c
msgraph
mtdev
mtools
nano
nano-syntax-highlighting
ncurses
nemo
neon
neovim
net-snmp
net-tools
netctl
nettle
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nfsidmap
nftables
nilfs-utils
nm-connection-editor
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
npth
nspr
nss
nss-mdns
ntfs-3g
ntp
oath-toolkit
ocl-icd
odt2txt
openal
openconnect
opencore-amr
openexr
openjpeg2
openssh
openssl
openvpn
opus
orc
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pango
pangomm
pangomm-2.48
parallel
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-alien-build
perl-alien-libxml2
perl-capture-tiny
perl-clone
perl-dbi
perl-encode-locale
perl-error
perl-ffi-checklib
perl-file-chdir
perl-file-listing
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-path-tiny
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-libxml
perl-xml-namespacesupport
perl-xml-parser
perl-xml-sax
perl-xml-sax-base
perl-xml-writer
pigz
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
polkit
poppler
poppler-data
poppler-glib
popt
portaudio
power-profiles-daemon
ppp
procps-ng
psmisc
pv
python
python-adal
python-annotated-types
python-argcomplete
python-attrs
python-autocommand
python-bcrypt
python-boto3
python-botocore
python-cachetools
python-cairo
python-capng
python-certifi
python-cffi
python-charset-normalizer
python-click
python-colorama
python-cryptography
python-dateutil
python-dbus
python-decorator
python-defusedxml
python-distro
python-dnspython
python-dogpile.cache
python-fastjsonschema
python-future
python-github3py
python-gobject
python-google-auth
python-httplib2
python-idna
python-inflect
python-iso8601
python-jaraco.classes
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jeepney
python-jinja
python-jmespath
python-jsonpatch
python-jsonpointer
python-jwcrypto
python-keyring
python-keystoneauth1
python-kubernetes
python-ldap
python-lxc
python-markupsafe
python-more-itertools
python-netifaces
python-oauth2client
python-oauthlib
python-openstacksdk
python-ordered-set
python-os-service-types
python-ovirt-engine-sdk
python-packaging
python-paramiko
python-pbr
python-pillow
python-pip
python-pipx
python-platformdirs
python-proxmoxer
python-psutil
python-pyaml
python-pyasn1
python-pyasn1-modules
python-pycparser
python-pycurl
python-pydantic
python-pydantic-core
python-pyjwt
python-pynacl
python-pynetbox
python-pyopenssl
python-pyparsing
python-pyqt5
python-pyqt5-sip
python-reportlab
python-requests
python-requests-oauthlib
python-requestsexceptions
python-resolvelib
python-rsa
python-s3transfer
python-secretstorage
python-setuptools
python-shtab
python-six
python-stevedore
python-termcolor
python-tomli
python-trove-classifiers
python-typeguard
python-typing_extensions
python-ujson
python-uritemplate
python-urllib3
python-userpath
python-validate-pyproject
python-websocket-client
python-wheel
python-yaml
qpdf
qrencode
qt5-base
qt5-declarative
qt5-multimedia
qt5-speech
qt5-svg
qt5-translations
qt5-wayland
qt5-x11extras
qt6-base
qt6-declarative
qt6-translations
raptor
rasqal
rav1e
readline
rebuild-detector
redland
redshift
reflector
reflector-simple
reiserfsprogs
rofi
rpcbind
rsync
rtkit
rtmpdump
rubberband
runc
s-nail
sane
sbc
sdl2
sed
serd
sg3_utils
shaderc
shadow
shared-mime-info
slang
slop
smartmontools
smbclient
snappy
sof-firmware
sord
sound-theme-freedesktop
soundtouch
spandsp
speex
speexdsp
spirv-tools
sqlite
sratom
srt
startup-notification
stoken
stow
sudo
svt-av1
svt-hevc
sysfsutils
systemd
systemd-libs
systemd-resolvconf
systemd-sysvcompat
talloc
tar
tcl
tdb
tevent
texinfo
thin-provisioning-tools
tk
tldr
tmux
tpm2-tss
tracker3
tree
tree-sitter
tree-sitter-bash
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-python
tree-sitter-query
tree-sitter-vimdoc
tslib
ttf-bitstream-vera
ttf-cascadia-code-nerd
ttf-dejavu
ttf-hack-nerd
ttf-jetbrains-mono-nerd
ttf-liberation
ttf-opensans
tzdata
udisks2
unibilium
unrar
unzip
upower
usb_modeswitch
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vapoursynth
vi
vid.stab
vmaf
volume_key
vpnc
vulkan-headers
vulkan-icd-loader
wayland
webkit2gtk-4.1
webrtc-audio-processing-1
welcome
wget
which
wildmidi
wireplumber
woff2
wpa_supplicant
wpebackend-fdo
wsdd
x264
x265
xapp
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-dde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xfsprogs
xkeyboard-config
xl2tpd
xmlsec
xorg-fonts-encodings
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorgproto
xsane
xsel
xterm
xvidcore
xxhash
xz
yad
yajl
yay
zbar
zeromq
zimg
zix
zlib
zstd
zvbi
zxing-cpp
